const conversion = {
  36: "1570-1600", 35: "1530-1560", 34: "1490-1520", 33: "1450-1480", 32: "1420-1440",
  31: "1390-1410", 30: "1360-1380", 29: "1330-1350", 28: "1300-1320", 27: "1260-1290",
  26: "1230-1250", 25: "1200-1220", 24: "1160-1190", 23: "1130-1150", 22: "1100-1120",
  21: "1060-1090", 20: "1030-1050", 19: "990-1020", 18: "960-980", 17: "920-950",
  16: "880-910", 15: "830-870", 14: "780-820", 13: "730-770", 12: "690-720",
  11: "650-680", 10: "620-640", 9: "590-610"
};
const mathConversion = {
  36: 800, 35: 780, 34: 760, 33: 740, 32: 720, 31: 710, 30: 700, 29: 680,
  28: 660, 27: 640, 26: 610, 25: 590, 24: 580, 23: 560, 22: 540, 21: 530,
  20: 520, 19: 510, 18: 500, 17: 470, 16: 430, 15: 400, 14: 360, 13: 330,
  12: 310, 11: 280, 10: 260
};
const englishConversion = {
  72: 790, 71: 770, 70: 750, 69: 740, 68: 730, 67: 720, 66: 710, 65: 700, 64: 700,
  63: 690, 62: 680, 61: 680, 60: 670, 59: 660, 58: 660, 57: 650, 56: 640, 55: 640,
  54: 630, 53: 630, 52: 620, 51: 610, 50: 610, 49: 600, 48: 590, 47: 580, 46: 580,
  45: 570, 44: 560, 43: 550, 42: 540, 41: 540, 40: 520, 39: 520, 38: 510, 37: 500,
  36: 490, 35: 490, 34: 480, 33: 470, 32: 460, 31: 450, 30: 440, 29: 430, 28: 420,
  27: 410, 26: 400, 25: 390, 24: 380, 23: 370, 22: 360, 21: 350, 20: 340, 19: 330,
  18: 320, 17: 310, 16: 300, 15: 290, 14: 280
};
export const tansik = [
    ["طب القاهرة",122.71],["طب عين شمس",122.09],["طب حلوان",121.90],["طب بنها",121.53],["طب الفيوم",121.22],["طب المنوفية بشبين الكوم",121.15],["طب الإسكندرية",121.04],["طب المنصورة",121.00],["طب أسيوط",120.61],["طب أسنان الإسكندرية",120.49],["طب الزقازيق",120.47],["طب طنطا",120.47],["طب فاقوس",120.36],["طب دمياط",120.29],["طب أسنان طنطا",120.29],["طب كفر الشيخ",120.25],["طب السويس",120.23],["طب بني سويف",120.18],["طب قناة السويس بالإسماعيلية",120.18],["طب بور سعيد",120.04],["طب أسنان أسيوط",119.80],["طب أسوان",119.74],["طب المنيا",119.74],["طب سوهاج",119.65],["طب أسنان المنصورة",119.56],["طب الاقصر",119.56],["طب العريش",119.56],["طب الوادي الجديد",119.50],["صيدلة عين شمس",119.50],["طب جنوب الوادي",119.37],["طب أسنان القاهرة",119.31],["طب أسنان كفر الشيخ",119.31],["طب أسنان الزقازيق",119.31],["طب أسنان عين شمس",119.28],["طب أسنان جنوب الوادي",119.26],["طب أسنان الفيوم",119.24],["طب أسنان المنوفية",119.24],["طب أسنان السويس",119.23],["طب أسنان قناة السويس بالإسماعيلية",119.18],["طب أسنان بني سويف",119.12],["طب أسنان المنيا",119.09],["صيدلة القاهرة",118.99],["صيدلة قناة السويس بالإسماعيلية",118.71],["صيدلة حلوان",118.46],["علاج طبيعي القاهرة",118.46],["صيدلة الإسكندرية",118.45],["صيدلة المنوفية",118.38],["صيدلة الفيوم",118.37],["هندسة بترول و تعدين السويس",118.17],["علاج طبيعي بنها",118.17],["علاج طبيعي بني سويف",118.13],["علاج طبيعي السويس",118.13],["صيدلة دمنهور",118.11],["علاج طبيعي بورسعيد",118.08],["صيدلة أسيوط",118.07],["صيدلة الزقازيق",118.07],["علاج طبيعي كفر الشيخ",118.02],["هندسة القاهرة",117.95],["علاج طبيعي قناة السويس",117.93],["صيدلة المنصورة",117.76],["علاج طبيعي جنوب الوادي",117.70],["صيدلة المنيا",117.51],["صيدلة بني سويف",117.49],["صيدلة طنطا",117.37],["هندسة عين شمس",117.36],["هندسة الإسكندرية",117.35],["صيدلة و تصنيع دوائي كفر الشيخ",117.34],["صيدلة مدينة السادات",117.20],["كلية الهندسة جامعة دمنهور",117.03],["صيدلة بور سعيد",116.99],["صيدلة ج الوادي الجديد",116.89],["صيدلة جنوب الوادي",116.72],["صيدلة سوهاج",116.72],["هندسة بنها بشبرا",116.65],["هندسة طنطا",116.48],["هندسة أسيوط",116.41],["هندسة حلوان",116.37],["هندسة إلكترونية المنوفية بمنوف",116.25],["هندسة كفر الشيخ",116.16],["هندسة حلوان بالمطرية",116.03],["هندسة بنها",115.79],["هندسة الطاقة أسوان",115.60],["هندسة المنوفية بشبين الكوم",115.51],["هندسة الفيوم",115.21],["هندسة أسوان",115.17],["هندسة المنصورة",115.04],["هندسة الزقازيق",115.01],["هندسة المنيا",114.98],["هندسة قناة السويس بالإسماعيلية",114.93],["هندسة السويس",114.91],["علوم البترول والتعدين مطروح",114.82],["هندسة جنوب الوادي",114.70],["هندسة بور سعيد",114.64],["هندسة دمياط",114.53],["هندسة بني سويف",114.49],["هندسة سوهاج",114.40],["حاسبات و علوم البيانات الإسكندرية رياضة",114.19],["حاسبات و ذكاء إصطناعي القاهرة رياضة",113.74],["حاسبات و علوم البيانات الإسكندرية علوم",113.50],["حاسبات ومعلومات عين شمس رياضة",112.81],["تخطيط عمراني القاهرة",112.64],["فنون جميلة (عمارة) الإسكندرية",111.83],["حاسبات و ذكاء إصطناعي القاهرة علوم",111.54],["فنون جميلة (عمارة) حلوان",110.54],["حاسبات و ذكاء إصطناعي حلوان رياضة",110.46],["اقتصاد و علوم سياسية القاهرة",109.93],["حاسبات ومعلومات عين شمس علوم",109.82],["فنون جميلة (عمارة) أسيوط",109.76],["حاسبات و ذكاء إصطناعي حلوان علوم",109.60],["حاسبات ومعلومات أسيوط رياضة",109.22],["حاسبات ومعلومات طنطا رياضة",109.14],["حاسبات ومعلومات دمنهور بالنوبارية رياضة",108.83],["الدراسات الاقتصادية و العلوم السياسة الإسكندرية",108.74],["حاسبات ومعلومات دمنهور بالنوبارية علوم",108.49],["فنون جميلة (عمارة) المنصورة",107.97],["سياسة واقتصاد السويس",107.88],["معهد هندسة وتكنولوجيا الطيران إمبابة جيزة بمصروفات",107.82],["حاسبات ومعلومات طنطا علوم",107.79],["حاسبات ومعلومات المنوفية بشبين الكوم رياضة",106.53],["طب بيطري الإسكندرية",106.45],["علوم البترول والتعدين مطروح - علوم",105.78],["طب بيطري عين شمس",105.46],["حاسبات و ذكاء اصطناعي بنها رياضة",105.18],["طب بيطري القاهرة",105.11],["حقوق المنيا",104.79],["سياسة واقتصاد بني سويف",104.77],["حاسبات ومعلومات أسيوط علوم",104.42],["إعلام القاهرة",103.99],["فنون جميلة (فنون) الإسكندرية",103.81],["حاسبات ومعلومات المنوفية بشبين الكوم علوم",103.45],["المعهد الكندى العالى للحاسب الالى بالتجمع الخامس",103.35],["الذكاء الاصطناعى كفر الشيخ رياضة",102.07],["إعلام عين شمس",101.79],["طب بيطري المنوفية",101.53],["إعلام المنوفية",100.51],["فنون جميلة (عمارة) المنيا",100.48],["طب بيطري أسيوط",100.22],["فنون جميلة (فنون) حلوان",100.07],["حاسبات و ذكاء إصطناعي بنها علوم",99.92],["طب بيطري دمنهور",98.72],["ألسن عين شمس",98.19],["حاسبات ومعلومات المنصورة رياضة",98.01],["حاسبات ومعلومات كفر الشيخ رياضة",97.94],["الذكاء الاصطناعى كفر الشيخ علوم",97.79],["طب بيطري كفر الشيخ",97.79],["المعهد الكندى العالى للهندسة 6 اكتوبر",97.22],["فنون جميلة (فنون) المنصورة",96.41],["معهد عالي كندي تكنولوجيا هندسة ت.خامس",94.93],["ألسن الفيوم",93.72],["فنون تطبيقية حلوان",91.00],["إعلام بني سويف",90.82],["ذكاء اصطناعي المنوفية شبين الكوم رياضة",90.47],["تجارة انتساب موجه بني سويف",90.00],["ألسن قناة السويس بالإسماعيلية",87.19],["ألسن بني سويف",86.87],["الاكاديمية الدولية لعلوم الإعلام (شعبة هندسة )6اكتوبر",85.33],["المعهد العالى للهندسة والتكنولوجيا الحديثة بالمرج",83.37],["العالي للهندسة والتكنولوجيا التجمع الخامس",82.81],["أكاديمية أخبار اليوم شعبة هندسية 6 أكتوبر",82.14],["معهد القناة العالى للهندسة بالسويس",81.66],["ألسن أسوان",80.50],["تجارة القاهرة",80.05],["حقوق سوهاج",79.38],["فنون جميلة (فنون) المنيا",79.05],["حقوق القاهرة",79.00],["تجارة و إدارة أعمال حلوان",76.07],["حقوق انتساب موجه القاهرة",74.55],["ع.كندى تكنو.اعلام ت.خامس",64.95]
];
const est1 = document.getElementById("est1");
const est2 = document.getElementById("est2");
const gpa = document.getElementById("gpa");
const uni = document.getElementById("uni");
const result = document.getElementById("result");
const actMath = document.getElementById("actMath");
const actEnglish = document.getElementById("actEnglish");
const actReading = document.getElementById("actReading");
const estResult = document.getElementById("estResult");
const estRange = document.getElementById("estRange");
const tansikTable = document.getElementById("tansik");
const matchTable = document.getElementById("matchTable");
let score1 = 0;
let score2 = 0;
let gpaScore = 0;
let uniType = null;
let total = 0;
let actScore = 0;

function getScore(){
    score1 = Number(est1.value);
    score2 = Number(est2.value);
    gpaScore = Number(gpa.value);
    uniType = uni.value;
    matchTable.innerHTML = "";

    if(!score1 || !score2 || !gpaScore){
        alert("Please enter your scores and GPA!");
        result.textContent = "=";
        return;
    } else if(uniType !== "public" && uniType !== "private"){
        alert("Please choose your university type!");
        result.textContent = "=";
        return;
    } else if(score1 < 400 || score1 > 1600 || score2 < 400 || score2 > 1600 || score1 % 10 !== 0 || score2 % 10 !== 0){
        alert("Please enter a valid EST score!");
        result.textContent = "=";
        return;
    } else if (gpaScore > 40 || gpaScore < 0){
        alert("Please enter a valid GPA!");
        result.textContent = "=";
        return;
    }

    if(score1 > 1090){
        if(uniType === "public"){
            score1 = (score1/1600)*69;    
        } else if(uniType === "private"){
            score1 = (score1/1600)*75;    
        }
    } else {
        score1 = (score1/1600)*60;    
    }
    score2 = (score2/1600)*15;
    total = score1 + score2 + gpaScore;
    total = Number(total).toFixed(2);
    result.textContent = total;
    result.innerHTML += "<br><a href='#tansik' style='font-size: 20px'>See Tansik</a>";

    tansikTable.style.display = "block";
    let uniMatches = tansik.filter(e => e[1]<=total);
    uniMatches.forEach(e => {
        let row = matchTable.insertRow();
        row.insertCell().textContent = e[0];
        row.insertCell().textContent = e[1];
    });

    if(uniMatches.length === 0){
        let row = matchTable.insertRow();
        row.insertCell().textContent = "No matches found";
        row.insertCell().textContent = "---";
    }
}
function convert(){
    estResult.value = "";
    estRange.value = "";
    let actArray = [actMath.value, actEnglish.value, actReading.value];

    actArray = actArray.map(Number);

    if(!actArray.every(e => typeof e === "number" && !Number.isNaN(e) && e <= 36 && e >= 10 && Number.isInteger(e))){
        alert("Please enter a valid ACT Score.");
        return;
    }

    let englishScore = actArray[1]+actArray[2];
    let mathScore = actArray[0];
    let avg = Math.round((englishScore/2 + mathScore)/2);

    englishScore = englishConversion[englishScore] || "-";
    mathScore = mathConversion[mathScore] || "-";
    let actTotal = englishScore + mathScore;
    let range = conversion[avg] || "Error";
    estResult.value = actTotal;
    estRange.value = range;
}
function showAllMatches(){
    matchTable.innerHTML = "";
    tansik.forEach(e => {
        let row = matchTable.insertRow();
        row.insertCell().textContent = e[0];
        row.insertCell().textContent = e[1];
    });
}
function searchUnis(name){
    matchTable.innerHTML = "";
    let searchMatch = tansik.filter(e => e[0].includes(name.trim()));
    searchMatch.forEach(e => {
        let row = matchTable.insertRow();
        row.insertCell().textContent = e[0];
        row.insertCell().textContent = e[1];
    });
    if(searchMatch.length === 0){
        let row = matchTable.insertRow();
        row.insertCell().textContent = "No matches found";
        row.insertCell().textContent = "---";
    }
}
if(document.getElementById("calculate")){
    document.getElementById("calculate").addEventListener("click", getScore);
    document.getElementById("actSubmit").addEventListener("click", convert);
    document.getElementById("allButton").addEventListener("click", showAllMatches);
    document.getElementById("searchUni").addEventListener("change", function(){ searchUnis(this.value); });
}